----------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/kismet/economics/predoc_datatask25/analysis/scripts/../logs/predoc25
> exc_log.txt
  log type:  text
 opened on:   7 Jan 2026, 19:03:43

. 
. * import raw data
. use ../raw_data/data-task-2025-ozone.dta, clear

. 
. 
. * change variables that 
. gen date1 = date(date, "MDY")

. format date1 %td

. drop date

. rename date1 date 

. 
. save ../data/ozone, replace
file ../data/ozone.dta saved

. 
. use ../raw_data/data-task-2025-pm, clear

. 
. destring county_code, replace
county_code: all characters numeric; replaced as int

. 
. save ../data/pm, replace
file ../data/pm.dta saved

. 
. use ../data/ozone

. 
. * 1. 
. merge 1:1 siteid date county_code using ../data/pm

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            33,877  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
. save ../data/dfmerged.dta, replace
file ../data/dfmerged.dta saved

. 
. use ../data/dfmerged, clear

. 
. * 2. Produce a table with the mean, median, minimum, maximum, and standard deviation f
> or ozone, PM 2.5, and AQI for the entire sample.
. 
. tabstat ozone_value pm25_value aqi, ///
>     statistics(mean median min max sd) ///
>     columns(statistics) format(%9.3f)

    Variable |      Mean       p50       Min       Max        SD
-------------+--------------------------------------------------
 ozone_value |     0.043     0.041     0.000     0.139     0.015
  pm25_value |     7.533     6.350    -2.800   154.400     5.793
         aqi |    36.693    35.500     0.000   230.000    19.587
----------------------------------------------------------------

.         
. * 3. Produce a table with the same statistics for just ozone, but split the sample by 
> the source variable(AQS vs. AirNow). In other words, your table should report the mean
> , min, etc., for the portion of the data that comes for AQS and those same numbers for
>  the data coming from AirNow. Also include the number of observations for each group.
. 
. tabstat ozone_value, by(ozone_source) ///
>     statistics(n mean median min max sd) ///
>     columns(statistics) 

Summary for variables: ozone_value
Group variable: ozone_source (Source)

ozone_source |         N      Mean       p50       Min       Max        SD
-------------+------------------------------------------------------------
         AQS |     30021    .04434      .042         0      .139  .0145192
      AirNow |      3856  .0333019      .032      .003      .083  .0103021
-------------+------------------------------------------------------------
       Total |     33877  .0430836      .041         0      .139   .014532
--------------------------------------------------------------------------

. 
. *4. .....
. // t test between the mean, same variance
. 
. *5. Create a county-day dataset to proceed with the analysis. All subsequent questions
>  will use this new dataset. The data set should contain the three pollution variables,
>  mortality, the county name and code, the date, and the CBSA name and code (one county
>  is always assigned the same CBSA). How did you reconcile different pollution readings
>  for different monitors within the county?
. collapse (mean) aqi ozone_value pm25_value mortality, by(date county_code county_name 
> cbsaname cbsacode)

. 
. 
. *6 How many counties are missing days?
. sort county_code date

. by county_code: gen gap = date - date[_n-1]
(44 missing values generated)

. quietly levelsof county_name if gap > 1 & !missing(gap), local(counties_with_gap)

. 
. unique county_name if gap > 1 & !missing(gap)
Number of unique values of county_name is  31
Number of records is  498

. 
. 
. foreach county of local counties_with_gap{
  2.         display "----`county'----"
  3. }
----Alameda----
----Butte----
----Calaveras----
----Colusa----
----Contra Costa----
----Glenn----
----Humboldt----
----Imperial----
----Kings----
----Lake----
----Madera----
----Marin----
----Mariposa----
----Merced----
----Nevada----
----Orange----
----San Benito----
----San Francisco----
----San Joaquin----
----San Luis Obispo----
----San Mateo----
----Santa Clara----
----Santa Cruz----
----Shasta----
----Siskiyou----
----Solano----
----Sonoma----
----Stanislaus----
----Sutter----
----Tehama----
----Yolo----

. 
. ******************************************************
. * Section 2
. ******************************************************
. 
. * 1. Produce a plot showing the distributions of ozone and PM 2.5. The distributions s
> hould be separate lines, sets of dots, bars, etc, but on the same set of axis. Choose 
> an appropriate type of graph to complete this task and make your graph easy to digest.
>  Hint: Pay attention to the scale of the variables. Can we preserve the distribution w
> hile standardizing the scales?
. summarize ozone_value

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
 ozone_value |     14,515    .0408301    .0129988       .002       .101

. gen ozone_z = (ozone_value - r(mean)) / r(sd)

. 
. summarize pm25_value 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
  pm25_value |     14,515    7.050578    4.983097       -2.8         79

. gen pm25_z = (pm25_value - r(mean)) / r(sd)

. 
. graph twoway (kdensity ozone_z) (kdensity pm25_z), title(Distribution of Ozone and PM2
> .5) legend(order(1 "Ozone" 2 "PM2.5")) xtitle(Value) ytitle(Density)

. graph export ../results/figures/sec2_1_kernel.pdf, as(pdf) replace 
file
    /Users/kismet/economics/predoc_datatask25/analysis/scripts/../results/figures/sec2
    > _1_kernel.pdf saved as PDF format

. 
. // Yes we can preserve the distribution while standarzing the scales
. 
. * 2. Produce a time series plot of ozone for Los Angeles county (Code: 037) in the mon
> th of February. Do you suspect autocorrelation? 1 How might you test for it (you do no
> t need to test it)?
. 
. xtset county_code date

Panel variable: county_code (unbalanced)
 Time variable: date, 01jan2024 to 31dec2024, but with gaps
         Delta: 1 day

. tsline ozone_value if county_code == 37 & month(date) == 2

. graph export ../results/figures/sec2_2_ozone_la_feb.pdf, as(pdf) replace
file
    /Users/kismet/economics/predoc_datatask25/analysis/scripts/../results/figures/sec2
    > _2_ozone_la_feb.pdf saved as PDF format

. 
. ******************************************************
. * Section 3: POLLUTION AND MORTALITY
. ******************************************************
. 
. * 1. Estimate the association between pollution and mortality by running the following
>  regression: Mortalityit = β0 + β1AQIit + αi + αt (1) where αi and αt are fixed effect
> s for county i and time t. Report and interpret β1. Why do we include fixed effects?
. 
. xtreg mortality aqi i.date, fe

Fixed-effects (within) regression               Number of obs     =     13,746
Group variable: county_code                     Number of groups  =         41

R-squared:                                      Obs per group:
     Within  = 0.7016                                         min =        155
     Between = 0.9965                                         avg =      335.3
     Overall = 0.7453                                         max =        364

                                                F(364, 13341)     =      86.16
corr(u_i, Xb) = 0.3775                          Prob > F          =     0.0000

------------------------------------------------------------------------------
   mortality | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         aqi |   .5277117   .0044013   119.90   0.000     .5190846    .5363388
             |
        date |
      23379  |   -5.47392   1.398789    -3.91   0.000    -8.215745   -2.732094
      23380  |  -7.056681   1.399849    -5.04   0.000    -9.800584   -4.312779
      23381  |  -4.524964   1.400231    -3.23   0.001    -7.269616   -1.780312
      23382  |   1.633723   1.390032     1.18   0.240    -1.090938    4.358383
      23383  |  -6.638709   1.381879    -4.80   0.000    -9.347387    -3.93003
      23384  |  -5.272665    1.39073    -3.79   0.000    -7.998694   -2.546636
      23385  |  -1.831883   1.390144    -1.32   0.188    -4.556762    .8929963
      23386  |  -3.129427   1.390082    -2.25   0.024    -5.854185    -.404669
      23387  |  -9.724317   1.391474    -6.99   0.000     -12.4518   -6.996831
      23388  |  -3.709713   1.383042    -2.68   0.007    -6.420672   -.9987542
      23389  |  -2.236979   1.382412    -1.62   0.106    -4.946702    .4727447
      23390  |  -2.944194   1.382453    -2.13   0.033    -5.653998   -.2343913
      23391  |  -4.947195   1.392246    -3.55   0.000    -7.676196   -2.218195
      23392  |  -2.714484   1.391336    -1.95   0.051      -5.4417    .0127311
      23393  |  -4.324733   1.392196    -3.11   0.002    -7.053635   -1.595831
      23394  |  -4.247147   1.393324    -3.05   0.002     -6.97826   -1.516033
      23395  |   1.715072   1.390145     1.23   0.217    -1.009809    4.439952
      23396  |  -2.274073   1.390448    -1.64   0.102     -4.99955    .4514026
      23397  |  -4.724068   1.390845    -3.40   0.001    -7.450322   -1.997814
      23398  |  -9.050375   1.398917    -6.47   0.000    -11.79245   -6.308299
      23399  |  -7.068438   1.408075    -5.02   0.000    -9.828466   -4.308411
      23400  |  -7.228628    1.40828    -5.13   0.000    -9.989055     -4.4682
      23401  |  -5.249261   1.408557    -3.73   0.000    -8.010234   -2.488289
      23402  |  -4.186076   1.399308    -2.99   0.003    -6.928917   -1.443235
      23403  |  -4.799421   1.399647    -3.43   0.001    -7.542927   -2.055914
      23404  |  -4.880661   1.400562    -3.48   0.000    -7.625961   -2.135361
      23405  |  -3.976807    1.40085    -2.84   0.005    -6.722671   -1.230942
      23406  |  -1.552377   1.399108    -1.11   0.267    -4.294827    1.190073
      23407  |  -.7362044   1.390403    -0.53   0.596    -3.461591    1.989182
      23408  |  -3.846874    1.39914    -2.75   0.006    -6.589387   -1.104362
      23409  |  -7.682829   1.399095    -5.49   0.000    -10.42525   -4.940404
      23410  |   -6.51697   1.418419    -4.59   0.000    -9.297272   -3.736668
      23411  |  -8.109462   1.408538    -5.76   0.000     -10.8704   -5.348528
      23412  |    -7.8723   1.399328    -5.63   0.000    -10.61518   -5.129419
      23413  |  -8.539957   1.417851    -6.02   0.000    -11.31915   -5.760768
      23414  |  -8.302588    1.41775    -5.86   0.000    -11.08158   -5.523598
      23415  |  -6.497229    1.42783    -4.55   0.000    -9.295978   -3.698481
      23416  |  -6.121121   1.398864    -4.38   0.000    -8.863094   -3.379149
      23417  |  -7.995567   1.390897    -5.75   0.000    -10.72192   -5.269212
      23418  |  -5.443234   1.382913    -3.94   0.000    -8.153938   -2.732529
      23419  |   -4.12308   1.391562    -2.96   0.003     -6.85074   -1.395421
      23420  |  -2.597793   1.399826    -1.86   0.064     -5.34165    .1460639
      23421  |  -.2530867   1.398823    -0.18   0.856    -2.994979    2.488806
      23422  |   -6.57319   1.400119    -4.69   0.000    -9.317621   -3.828759
      23423  |  -3.937826   1.390685    -2.83   0.005    -6.663765   -1.211887
      23424  |   .7292451    1.39061     0.52   0.600    -1.996547    3.455037
      23425  |  -7.101886   1.381953    -5.14   0.000     -9.81071   -4.393061
      23426  |  -8.102612   1.390194    -5.83   0.000    -10.82759   -5.377634
      23427  |  -6.483588   1.390327    -4.66   0.000    -9.208826   -3.758349
      23428  |  -8.456845   1.398863    -6.05   0.000    -11.19882   -5.714875
      23429  |  -6.733187   1.408023    -4.78   0.000    -9.493111   -3.973262
      23430  |  -5.396823   1.408626    -3.83   0.000     -8.15793   -2.635717
      23431  |  -4.766499   1.399635    -3.41   0.001    -7.509982   -2.023015
      23432  |  -2.380041   1.390101    -1.71   0.087    -5.104835     .344754
      23433  |   -3.37522   1.390023    -2.43   0.015    -6.099863   -.6505771
      23434  |  -6.664627    1.39042    -4.79   0.000    -9.390047   -3.939208
      23435  |  -3.301383   1.398921    -2.36   0.018    -6.043467   -.5592996
      23436  |  -4.114496   1.419159    -2.90   0.004    -6.896249   -1.332743
      23437  |  -5.725568   1.419205    -4.03   0.000    -8.507411   -2.943725
      23438  |  -8.307031   1.418682    -5.86   0.000    -11.08785   -5.526214
      23439  |  -9.002542     1.4181    -6.35   0.000    -11.78222   -6.222865
      23440  |  -8.041781   1.438677    -5.59   0.000    -10.86179    -5.22177
      23441  |   -7.00136   1.438744    -4.87   0.000    -9.821503   -4.181217
      23442  |  -6.907666   1.461467    -4.73   0.000    -9.772348   -4.042984
      23443  |  -8.569522   1.438457    -5.96   0.000     -11.3891   -5.749942
      23444  |  -4.849163    1.42785    -3.40   0.001    -7.647952   -2.050374
      23445  |  -3.380563   1.417777    -2.38   0.017    -6.159606   -.6015194
      23446  |  -5.866159   1.427925    -4.11   0.000    -8.665094   -3.067224
      23447  |  -6.279504   1.438417    -4.37   0.000    -9.099006   -3.460003
      23448  |  -5.630841    1.43852    -3.91   0.000    -8.450544   -2.811138
      23449  |  -6.033408   1.450302    -4.16   0.000    -8.876207    -3.19061
      23450  |  -6.836668   1.474327    -4.64   0.000    -9.726558   -3.946779
      23451  |  -9.824184    1.47361    -6.67   0.000    -12.71267   -6.935699
      23452  |  -7.395649   1.461331    -5.06   0.000    -10.26006   -4.531233
      23453  |  -7.272029   1.461701    -4.98   0.000    -10.13717   -4.406887
      23454  |  -5.011736   1.461902    -3.43   0.001    -7.877271     -2.1462
      23455  |  -2.919694   1.461473    -2.00   0.046    -5.784389   -.0550003
      23456  |  -1.769274   1.449558    -1.22   0.222    -4.610613    1.072064
      23457  |  -3.667373   1.427795    -2.57   0.010    -6.466054   -.8686917
      23458  |  -2.416744   1.428586    -1.69   0.091    -5.216976    .3834879
      23459  |  -6.252769    1.42858    -4.38   0.000    -9.052989    -3.45255
      23460  |  -8.312826   1.438544    -5.78   0.000    -11.13258   -5.493076
      23461  |  -8.548976     1.4384    -5.94   0.000    -11.36844   -5.729507
      23462  |  -6.228916   1.438394    -4.33   0.000    -9.048372    -3.40946
      23463  |  -4.860379   1.438416    -3.38   0.001    -7.679879   -2.040878
      23464  |   -5.63364    1.41787    -3.97   0.000    -8.412867   -2.854413
      23465  |   -3.46239   1.418915    -2.44   0.015    -6.243665   -.6811145
      23466  |  -7.902487   1.418183    -5.57   0.000    -10.68233   -5.122646
      23467  |  -10.29066   1.417763    -7.26   0.000    -13.06968   -7.511644
      23468  |  -7.808129   1.418001    -5.51   0.000    -10.58761   -5.028647
      23469  |  -4.985004   1.427881    -3.49   0.000    -7.783854   -2.186154
      23470  |  -1.824912   1.428231    -1.28   0.201    -4.624447    .9746237
      23471  |  -6.715504   1.439131    -4.67   0.000    -9.536404   -3.894604
      23472  |  -7.398334   1.427962    -5.18   0.000    -10.19734   -4.599326
      23473  |  -7.541024   1.427906    -5.28   0.000    -10.33992   -4.742126
      23474  |  -5.884185   1.427856    -4.12   0.000    -8.682985   -3.085386
      23475  |  -5.825344   1.438524    -4.05   0.000    -8.645055   -3.005634
      23476  |  -6.007905   1.439147    -4.17   0.000    -8.828838   -3.186972
      23477  |  -7.322667    1.44026    -5.08   0.000    -10.14578   -4.499553
      23478  |   -1.51634   1.428644    -1.06   0.289    -4.316686    1.284006
      23479  |   .2290166    1.42823     0.16   0.873    -2.570517     3.02855
      23480  |  -5.327395   1.409303    -3.78   0.000    -8.089829    -2.56496
      23481  |  -8.045088   1.408429    -5.71   0.000    -10.80581   -5.284368
      23482  |  -10.79798   1.417969    -7.62   0.000     -13.5774   -8.018557
      23483  |  -7.857297   1.418621    -5.54   0.000      -10.638   -5.076597
      23484  |  -5.123784   1.429421    -3.58   0.000    -7.925651   -2.321917
      23485  |  -2.442253   1.419791    -1.72   0.085    -5.225245    .3407398
      23486  |   -2.88776    1.41922    -2.03   0.042    -5.669632   -.1058868
      23487  |  -1.030974    1.40899    -0.73   0.464    -3.792795    1.730846
      23488  |  -6.206029   1.409981    -4.40   0.000    -8.969791   -3.442266
      23489  |  -2.574125   1.408944    -1.83   0.068    -5.335854    .1876045
      23490  |   -3.38788   1.408623    -2.41   0.016     -6.14898   -.6267796
      23491  |  -2.076426   1.461272    -1.42   0.155    -4.940727     .787875
      23492  |  -4.214531   1.461677    -2.88   0.004    -7.079625   -1.349437
      23493  |  -6.379928   1.461401    -4.37   0.000    -9.244481   -3.515376
      23494  |  -7.016909   1.417767    -4.95   0.000    -9.795932   -4.237885
      23495  |  -6.808556   1.438567    -4.73   0.000    -9.628351   -3.988761
      23496  |  -6.644925   1.438665    -4.62   0.000    -9.464912   -3.824937
      23497  |  -3.231421   1.449646    -2.23   0.026    -6.072933   -.3899086
      23498  |  -4.724283   1.449632    -3.26   0.001    -7.565767     -1.8828
      23499  |  -4.410401   1.449549    -3.04   0.002    -7.251723   -1.569079
      23500  |  -2.497847   1.438711    -1.74   0.083    -5.317924    .3222297
      23501  |  -4.298277    1.41812    -3.03   0.002    -7.077992   -1.518561
      23502  |  -7.043087   1.408317    -5.00   0.000    -9.803588   -4.282586
      23503  |  -7.177029   1.417765    -5.06   0.000     -9.95605   -4.398008
      23504  |  -5.747888    1.41778    -4.05   0.000    -8.526937   -2.968838
      23505  |  -7.009464   1.417868    -4.94   0.000    -9.788686   -4.230242
      23506  |  -5.510282   1.428105    -3.86   0.000    -8.309571   -2.710993
      23507  |   -3.17092    1.42792    -2.22   0.026    -5.969846   -.3719932
      23508  |  -5.089346    1.42792    -3.56   0.000    -7.888271   -2.290421
      23509  |  -3.963563   1.417946    -2.80   0.005    -6.742938   -1.184189
      23510  |  -4.574223   1.399156    -3.27   0.001    -7.316767   -1.831678
      23511  |  -5.600345   1.408437    -3.98   0.000    -8.361083   -2.839608
      23512  |  -4.093651    1.41805    -2.89   0.004    -6.873229   -1.314072
      23513  |  -2.463269   1.417808    -1.74   0.082    -5.242373    .3158349
      23514  |  -5.612314   1.418037    -3.96   0.000    -8.391868   -2.832759
      23515  |  -6.020712   1.418763    -4.24   0.000    -8.801689   -3.239734
      23516  |  -4.006771     1.4091    -2.84   0.004    -6.768806   -1.244735
      23517  |  -3.421015   1.408921    -2.43   0.015      -6.1827   -.6593291
      23518  |  -4.190342   1.408957    -2.97   0.003    -6.952098   -1.428587
      23519  |  -4.905247    1.41872    -3.46   0.001     -7.68614   -2.124354
      23520  |  -3.712732   1.418869    -2.62   0.009    -6.493916   -.9315488
      23521  |  -.2640761   1.417782    -0.19   0.852    -3.043131    2.514978
      23522  |  -5.923955   1.408425    -4.21   0.000    -8.684667   -3.163242
      23523  |  -7.983284   1.408736    -5.67   0.000    -10.74461   -5.221962
      23524  |  -3.570122   1.408917    -2.53   0.011      -6.3318   -.8084443
      23525  |  -3.382461   1.428382    -2.37   0.018    -6.182293   -.5826291
      23526  |   -4.60077   1.428715    -3.22   0.001    -7.401254   -1.800287
      23527  |  -4.383603   1.440113    -3.04   0.002    -7.206428   -1.560777
      23528  |   -3.70776    1.42027    -2.61   0.009    -6.491691   -.9238296
      23529  |   1.434356   1.417764     1.01   0.312    -1.344661    4.213374
      23530  |  -3.317503   1.417795    -2.34   0.019    -6.096583   -.5384239
      23531  |  -7.757772   1.438895    -5.39   0.000    -10.57821   -4.937335
      23532  |  -7.364637   1.428954    -5.15   0.000    -10.16559   -4.563684
      23533  |  -6.296927   1.420749    -4.43   0.000    -9.081795   -3.512058
      23534  |  -2.895456    1.41175    -2.05   0.040    -5.662686   -.1282271
      23535  |  -1.899666   1.410412    -1.35   0.178    -4.664275     .864942
      23536  |  -.6959127   1.409689    -0.49   0.622    -3.459103    2.067278
      23537  |  -3.136245   1.400922    -2.24   0.025     -5.88225    -.390239
      23538  |  -3.435371   1.431001    -2.40   0.016    -6.240336   -.6304055
      23539  |  -1.303597   1.421288    -0.92   0.359    -4.089523    1.482329
      23540  |  -2.180722   1.420748    -1.53   0.125    -4.965589    .6041455
      23541  |  -1.673815   1.402409    -1.19   0.233    -4.422735    1.075106
      23542  |   2.281135   1.399782     1.63   0.103    -.4626356    5.024905
      23543  |  -1.908082   1.399794    -1.36   0.173    -4.651876    .8357126
      23544  |  -3.553612   1.408539    -2.52   0.012    -6.314548   -.7926759
      23545  |  -4.465501   1.409282    -3.17   0.002    -7.227895   -1.703108
      23546  |   -4.37803   1.419735    -3.08   0.002    -7.160913   -1.595147
      23547  |  -4.774869   1.400528    -3.41   0.001    -7.520103   -2.029634
      23548  |  -3.918195   1.411487    -2.78   0.006     -6.68491    -1.15148
      23549  |  -4.789241   1.412735    -3.39   0.001    -7.558401   -2.020081
      23550  |   .7958549   1.391995     0.57   0.568    -1.932652    3.524362
      23551  |   .3365901   1.390958     0.24   0.809    -2.389885    3.063065
      23552  |  -4.493631   1.400328    -3.21   0.001    -7.238472   -1.748789
      23553  |  -2.282627   1.399167    -1.63   0.103    -5.025194     .459939
      23554  |  -5.220811   1.399352    -3.73   0.000     -7.96374   -2.477882
      23555  |  -5.277378   1.400418    -3.77   0.000    -8.022396   -2.532359
      23556  |  -4.291074   1.400519    -3.06   0.002    -7.036289   -1.545858
      23557  |   -.197836   1.408406    -0.14   0.888    -2.958512     2.56284
      23558  |  -4.690169   1.428126    -3.28   0.001    -7.489499    -1.89084
      23559  |  -7.267544   1.419247    -5.12   0.000    -10.04947   -4.485618
      23560  |    -5.9323   1.430833    -4.15   0.000    -8.736936   -3.127663
      23561  |  -3.092687   1.434245    -2.16   0.031     -5.90401   -.2813634
      23562  |   .2182034   1.433203     0.15   0.879    -2.591078    3.027484
      23563  |   .6362433   1.402677     0.45   0.650    -2.113203    3.385689
      23564  |  -.0353243   1.411375    -0.03   0.980    -2.801819    2.731171
      23565  |   -1.53822   1.430342    -1.08   0.282    -4.341892    1.265453
      23566  |  -3.069573   1.452026    -2.11   0.035     -5.91575   -.2233955
      23567  |  -3.737409   1.452308    -2.57   0.010     -6.58414   -.8906791
      23568  |  -4.445666   1.432257    -3.10   0.002    -7.253094   -1.638239
      23569  |  -1.866513    1.42293    -1.31   0.190    -4.655657    .9226308
      23570  |   .9189463   1.401617     0.66   0.512    -1.828421    3.666314
      23571  |   .9447408   1.399675     0.67   0.500    -1.798821    3.688302
      23572  |  -3.069366   1.390992    -2.21   0.027    -5.795907   -.3428249
      23573  |  -1.280487   1.417994    -0.90   0.367    -4.059956    1.498981
      23574  |  -2.522508   1.417791    -1.78   0.075    -5.301579    .2565631
      23575  |  -7.036453    1.40905    -4.99   0.000    -9.798391   -4.274514
      23576  |  -5.483186   1.419549    -3.86   0.000    -8.265703   -2.700669
      23577  |  -4.263793   1.420483    -3.00   0.003    -7.048141   -1.479444
      23578  |  -4.115183   1.420175    -2.90   0.004    -6.898927   -1.331438
      23579  |   -4.91897   1.412482    -3.48   0.000    -7.687636   -2.150305
      23580  |  -1.386736   1.410736    -0.98   0.326    -4.151978    1.378506
      23581  |  -1.194246    1.42098    -0.84   0.401    -3.979569    1.591076
      23582  |  -1.466185   1.411049    -1.04   0.299    -4.232042    1.299671
      23583  |   .0100349   1.429213     0.01   0.994    -2.791426    2.811496
      23584  |  -3.040649   1.419621    -2.14   0.032    -5.823307   -.2579906
      23585  |  -1.822856   1.419428    -1.28   0.199    -4.605136    .9594248
      23586  |  -2.223874   1.419431    -1.57   0.117    -5.006161     .558413
      23587  |  -.2354133   1.428243    -0.16   0.869    -3.034973    2.564146
      23588  |  -2.576646   1.450337    -1.78   0.076    -5.419512    .2662205
      23589  |  -4.516229   1.450788    -3.11   0.002     -7.35998   -1.672478
      23590  |  -3.907158   1.439889    -2.71   0.007    -6.729545   -1.084771
      23591  |  -4.389986    1.41899    -3.09   0.002    -7.171407   -1.608564
      23592  |  -3.889445   1.409077    -2.76   0.006    -6.651436   -1.127455
      23593  |  -7.117475   1.402671    -5.07   0.000    -9.866908   -4.368041
      23594  |  -3.981755   1.412511    -2.82   0.005    -6.750477   -1.213034
      23595  |  -2.031503   1.422359    -1.43   0.153    -4.819527    .7565218
      23596  |   -1.51568    1.42144    -1.07   0.286    -4.301904    1.270544
      23597  |  -2.028703    1.41221    -1.44   0.151    -4.796835    .7394296
      23598  |  -1.017639   1.420757    -0.72   0.474    -3.802523    1.767246
      23599  |  -.7727195   1.419436    -0.54   0.586    -3.555014    2.009575
      23600  |  -.5375982   1.429043    -0.38   0.707    -3.338725    2.263528
      23601  |   -4.55317   1.428556    -3.19   0.001    -7.353342   -1.752999
      23602  |  -2.099814   1.438602    -1.46   0.144    -4.919679    .7200509
      23603  |  -4.288401   1.408206    -3.05   0.002    -7.048684   -1.528117
      23604  |   -6.57783   1.408725    -4.67   0.000     -9.33913    -3.81653
      23605  |  -2.345954   1.408119    -1.67   0.096    -5.106067     .414158
      23606  |  -4.447112   1.399064    -3.18   0.001    -7.189475   -1.704749
      23607  |  -9.255973   1.398934    -6.62   0.000    -11.99808   -6.513864
      23608  |  -6.946544   1.398988    -4.97   0.000     -9.68876   -4.204328
      23609  |  -5.821244   1.398963    -4.16   0.000    -8.563409   -3.079078
      23610  |  -5.532014   1.381919    -4.00   0.000    -8.240772   -2.823257
      23611  |   -6.26534   1.390471    -4.51   0.000     -8.99086   -3.539819
      23612  |  -3.657996   1.390617    -2.63   0.009    -6.383802   -.9321901
      23613  |  -3.002554   1.390352    -2.16   0.031    -5.727842   -.2772669
      23614  |  -5.684478   1.390944    -4.09   0.000    -8.410926   -2.958031
      23615  |  -4.146004   1.391344    -2.98   0.003    -6.873236   -1.418771
      23616  |  -3.896199   1.391607    -2.80   0.005    -6.623945   -1.168452
      23617  |  -4.310347   1.410075    -3.06   0.002    -7.074294     -1.5464
      23618  |   -4.54745   1.411652    -3.22   0.001    -7.314487   -1.780413
      23619  |  -3.621542   1.411382    -2.57   0.010     -6.38805   -.8550332
      23620  |  -1.386686   1.400684    -0.99   0.322    -4.132225    1.358854
      23621  |  -.3631673   1.399258    -0.26   0.795    -3.105911    2.379577
      23622  |  -4.113489   1.399772    -2.94   0.003    -6.857241   -1.369737
      23623  |  -5.359083   1.391297    -3.85   0.000    -8.086221   -2.631944
      23624  |  -3.319011   1.400157    -2.37   0.018    -6.063516   -.5745048
      23625  |  -2.896297   1.408974    -2.06   0.040    -5.658084   -.1345086
      23626  |  -2.842624   1.399204    -2.03   0.042    -5.585262   -.0999856
      23627  |  -4.216179   1.399228    -3.01   0.003    -6.958865   -1.473494
      23628  |  -4.716907   1.399482    -3.37   0.001    -7.460091   -1.973723
      23629  |   -.936223   1.399211    -0.67   0.503    -3.678874    1.806428
      23630  |  -4.001342   1.408131    -2.84   0.004    -6.761479   -1.241205
      23631  |   -5.61903   1.398914    -4.02   0.000      -8.3611    -2.87696
      23632  |  -7.837794   1.409151    -5.56   0.000    -10.59993   -5.075659
      23633  |  -3.645602   1.399714    -2.60   0.009     -6.38924   -.9019632
      23634  |  -.3607576   1.390189    -0.26   0.795    -3.085725    2.364209
      23635  |  -5.656079   1.399081    -4.04   0.000    -8.398475   -2.913682
      23636  |  -3.788738   1.399218    -2.71   0.007    -6.531403   -1.046072
      23637  |  -3.075907   1.398917    -2.20   0.028    -5.817983   -.3338304
      23638  |  -2.937711   1.408076    -2.09   0.037    -5.697739   -.1776832
      23639  |  -6.156223   1.408108    -4.37   0.000    -8.916314   -3.396131
      23640  |  -6.466923   1.408637    -4.59   0.000    -9.228052   -3.705794
      23641  |  -4.237729   1.399843    -3.03   0.002    -6.981619   -1.493838
      23642  |  -3.497205    1.40028    -2.50   0.013    -6.241953   -.7524571
      23643  |  -2.853562   1.418932    -2.01   0.044     -5.63487   -.0722536
      23644  |  -2.411037   1.418794    -1.70   0.089    -5.192074    .3699995
      23645  |  -3.146824   1.408998    -2.23   0.026     -5.90866   -.3849888
      23646  |  -2.807993   1.409569    -1.99   0.046    -5.570948   -.0450384
      23647  |  -3.325936   1.409227    -2.36   0.018     -6.08822   -.5636515
      23648  |   -3.12314    1.40899    -2.22   0.027     -5.88496   -.3613194
      23649  |  -5.658815   1.410459    -4.01   0.000    -8.423515   -2.894114
      23650  |  -5.098694   1.411312    -3.61   0.000    -7.865067   -2.332322
      23651  |  -2.919317   1.411822    -2.07   0.039    -5.686688   -.1519452
      23652  |  -2.204853   1.402658    -1.57   0.116    -4.954262    .5445568
      23653  |  -2.510071   1.402512    -1.79   0.074    -5.259194    .2390513
      23654  |   -1.59773   1.401267    -1.14   0.254    -4.344411    1.148952
      23655  |  -1.779175   1.390939    -1.28   0.201    -4.505613     .947263
      23656  |  -3.089365    1.39144    -2.22   0.026    -5.816784   -.3619447
      23657  |  -4.406863   1.383435    -3.19   0.001    -7.118592   -1.695135
      23658  |  -1.346809   1.382548    -0.97   0.330      -4.0568    1.363182
      23659  |  -4.173484   1.391992    -3.00   0.003    -6.901986   -1.444982
      23660  |  -1.479774   1.391368    -1.06   0.288    -4.207052    1.247504
      23661  |  -.6617522   1.390066    -0.48   0.634    -3.386478    2.062974
      23662  |  -5.130066   1.390619    -3.69   0.000    -7.855877   -2.404255
      23663  |  -4.480338   1.399528    -3.20   0.001    -7.223611   -1.737065
      23664  |  -4.442077   1.399874    -3.17   0.002     -7.18603   -1.698125
      23665  |  -2.078914   1.398866    -1.49   0.137     -4.82089    .6630631
      23666  |  -3.424214   1.390095    -2.46   0.014    -6.148997   -.6994317
      23667  |  -6.901539    1.39897    -4.93   0.000     -9.64372   -4.159359
      23668  |  -6.354611   1.399738    -4.54   0.000    -9.098295   -3.610926
      23669  |  -3.534996   1.390685    -2.54   0.011    -6.260937   -.8090557
      23670  |  -3.475506   1.390484    -2.50   0.012    -6.201053   -.7499596
      23671  |  -5.703837   1.408892    -4.05   0.000    -8.465465    -2.94221
      23672  |  -5.741469   1.429647    -4.02   0.000     -8.54378   -2.939158
      23673  |  -.5913258   1.439501    -0.41   0.681    -3.412951      2.2303
      23674  |  -5.525865   1.441324    -3.83   0.000    -8.351065   -2.700666
      23675  |   -1.51018   1.440852    -1.05   0.295    -4.334454    1.314093
      23676  |   2.256355   1.417893     1.59   0.112    -.5229175    5.035627
      23677  |  -1.786836   1.417757    -1.26   0.208    -4.565841    .9921693
      23678  |  -4.450865    1.41772    -3.14   0.002    -7.229798   -1.671932
      23679  |  -7.535238    1.41772    -5.32   0.000    -10.31417   -4.756305
      23680  |  -5.307768    1.41773    -3.74   0.000    -8.086719   -2.528816
      23681  |  -6.812189   1.408802    -4.84   0.000    -9.573642   -4.050737
      23682  |  -5.526511   1.408465    -3.92   0.000    -8.287301    -2.76572
      23683  |  -1.133784   1.408114    -0.81   0.421    -3.893888    1.626321
      23684  |   -5.35581   1.398924    -3.83   0.000      -8.0979    -2.61372
      23685  |  -4.818106   1.399013    -3.44   0.001     -7.56037   -2.075843
      23686  |  -3.811787   1.398952    -2.72   0.006    -6.553932   -1.069642
      23687  |  -6.424399   1.390707    -4.62   0.000    -9.150382   -3.698416
      23688  |  -8.498015   1.393531    -6.10   0.000    -11.22953   -5.766497
      23689  |  -6.103139   1.396959    -4.37   0.000    -8.841376   -3.364902
      23690  |  -1.443794   1.397029    -1.03   0.301    -4.182169    1.294581
      23691  |   4.046806   1.391161     2.91   0.004     1.319934    6.773678
      23692  |  -.0732123   1.390359    -0.05   0.958    -2.798512    2.652088
      23693  |  -4.282558   1.399794    -3.06   0.002    -7.026353   -1.538762
      23694  |  -3.271023   1.408581    -2.32   0.020    -6.032042   -.5100047
      23695  |  -2.607358   1.408182    -1.85   0.064    -5.367594    .1528779
      23696  |  -6.664055   1.409143    -4.73   0.000    -9.426175   -3.901934
      23697  |  -6.425465   1.400846    -4.59   0.000    -9.171322   -3.679608
      23698  |   -1.88058   1.399688    -1.34   0.179    -4.624167    .8630067
      23699  |  -4.201589   1.419278    -2.96   0.003    -6.983576   -1.419602
      23700  |  -1.346712   1.418074    -0.95   0.342    -4.126338    1.432914
      23701  |  -1.718119    1.42795    -1.20   0.229    -4.517103    1.080866
      23702  |  -4.375775   1.399191    -3.13   0.002    -7.118389   -1.633162
      23703  |  -3.712737   1.398898    -2.65   0.008    -6.454774   -.9706987
      23704  |  -5.231112   1.398915    -3.74   0.000    -7.973185    -2.48904
      23705  |   -5.89972   1.408054    -4.19   0.000    -8.659706   -3.139733
      23706  |  -6.173163   1.408051    -4.38   0.000    -8.933142   -3.413184
      23707  |  -6.406146   1.408326    -4.55   0.000    -9.166666   -3.645627
      23708  |  -5.548713    1.40903    -3.94   0.000    -8.310611   -2.786815
      23709  |  -6.002768   1.410217    -4.26   0.000    -8.766994   -3.238542
      23710  |  -5.449168   1.403626    -3.88   0.000    -8.200474   -2.697862
      23711  |  -1.878467   1.414196    -1.33   0.184    -4.650492    .8935582
      23712  |  -1.016117   1.414494    -0.72   0.473    -3.788725    1.756492
      23713  |   -1.68528   1.417693    -1.19   0.235     -4.46416      1.0936
      23714  |   -.801614   1.419478    -0.56   0.572    -3.583993    1.980765
      23715  |   .7929454   1.420613     0.56   0.577    -1.991658    3.577549
      23716  |   2.121402   1.409731     1.50   0.132    -.6418708    4.884674
      23717  |   .7620152   1.413467     0.54   0.590     -2.00858     3.53261
      23718  |   4.364899    1.39925     3.12   0.002      1.62217    7.107627
      23719  |   5.676272   1.384685     4.10   0.000     2.962093    8.390452
      23720  |  -2.725184   1.396297    -1.95   0.051    -5.462123    .0117558
      23721  |  -2.486247   1.399042    -1.78   0.076    -5.228568    .2560742
      23722  |    3.88525   1.393308     2.79   0.005     1.154169    6.616331
      23723  |   3.051871   1.390419     2.19   0.028     .3264528    5.777289
      23724  |  -2.049693   1.417695    -1.45   0.148    -4.828577    .7291916
      23725  |  -5.298195    1.43926    -3.68   0.000    -8.119349    -2.47704
      23726  |  -4.886408   1.450527    -3.37   0.001    -7.729648   -2.043169
      23727  |  -3.292684   1.450383    -2.27   0.023    -6.135641    -.449728
      23728  |  -4.117351   1.451307    -2.84   0.005    -6.962118   -1.272584
      23729  |  -5.096904   1.432097    -3.56   0.000    -7.904016   -2.289791
      23730  |  -4.233718   1.414098    -2.99   0.003     -7.00555   -1.461886
      23731  |  -1.355919   1.413105    -0.96   0.337    -4.125806    1.413967
      23732  |   .1541505   1.402094     0.11   0.912    -2.594153    2.902454
      23733  |   -.964533   1.393337    -0.69   0.489     -3.69567    1.766604
      23734  |  -1.034957   1.390769    -0.74   0.457    -3.761061    1.691148
      23735  |  -4.617008   1.391093    -3.32   0.001    -7.343748   -1.890268
      23736  |  -3.109878   1.390398    -2.24   0.025    -5.835254   -.3845012
      23737  |    -5.1622   1.399407    -3.69   0.000    -7.905236   -2.419164
      23738  |  -5.109931   1.399441    -3.65   0.000    -7.853034   -2.366828
      23739  |  -2.654214   1.408279    -1.88   0.059     -5.41464    .1062121
      23740  |  -4.061421   1.427933    -2.84   0.004    -6.860372    -1.26247
      23741  |   -7.28541   1.430473    -5.09   0.000    -10.08934    -4.48148
             |
       _cons |   20.11483   .9955447    20.20   0.000     18.16342    22.06624
-------------+----------------------------------------------------------------
     sigma_u |  1.3642634
     sigma_e |  6.1766991
         rho |  .04651545   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(40, 13341) = 11.75                  Prob > F = 0.0000

. // a unit increase in the aqi on average increases by 0.5277
. // county fixed effects absorb the heterogenity between the countries
. // time fixed effects control for events that affected all the counties on a specific 
> day
. // As we are interested in understanding how aqi affects the mortality, we need to inc
> lude fixed effects to absord the heterogenity across time and county.
. 
. * 2. I am concerned that yesterday's pollution affects mortality too. Include one lag 
> of AQI and rerun the regression. Report and interpret the coefficients on AQI and yest
> erday's AQI.
. xtreg mortality aqi L.aqi i.date, fe

Fixed-effects (within) regression               Number of obs     =     13,746
Group variable: county_code                     Number of groups  =         41

R-squared:                                      Obs per group:
     Within  = 0.8013                                         min =        155
     Between = 0.9973                                         avg =      335.3
     Overall = 0.8364                                         max =        364

                                                F(365, 13340)     =     147.35
corr(u_i, Xb) = 0.2829                          Prob > F          =     0.0000

------------------------------------------------------------------------------
   mortality | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
         aqi |
         --. |   .3048106   .0045085    67.61   0.000     .2959732     .313648
         L1. |   .3686984   .0045074    81.80   0.000     .3598634    .3775335
             |
        date |
      23379  |   .7639017   1.144092     0.67   0.504    -1.478681    3.006484
      23380  |   .5261357   1.146167     0.46   0.646    -1.720515    2.772786
      23381  |  -.2272472   1.143932    -0.20   0.843    -2.469516    2.015021
      23382  |    1.45232   1.134403     1.28   0.200    -.7712708    3.675911
      23383  |    .850295   1.131457     0.75   0.452    -1.367522    3.068112
      23384  |   .4909133   1.137156     0.43   0.666    -1.738073      2.7199
      23385  |   .9766837   1.135012     0.86   0.390      -1.2481    3.201467
      23386  |   1.194346   1.135673     1.05   0.293    -1.031734    3.420425
      23387  |  -.5287385   1.141129    -0.46   0.643    -2.765512    1.708035
      23388  |  -.2195733   1.129503    -0.19   0.846    -2.433559    1.994412
      23389  |   .5735074   1.128705     0.51   0.611    -1.638915     2.78593
      23390  |   1.274011   1.129393     1.13   0.259    -.9397597    3.487782
      23391  |   .6268428   1.138249     0.55   0.582    -1.604288    2.857973
      23392  |  -.5419818   1.135775    -0.48   0.633    -2.768263    1.684299
      23393  |   .2808009   1.137561     0.25   0.805     -1.94898    2.510582
      23394  |  -.1872859    1.13817    -0.16   0.869    -2.418261     2.04369
      23395  |   .1867255   1.134647     0.16   0.869    -2.037343    2.410794
      23396  |    .490041   1.135244     0.43   0.666    -1.735198     2.71528
      23397  |   1.384267   1.137518     1.22   0.224    -.8454299    3.613964
      23398  |  -.1825651   1.146788    -0.16   0.874    -2.430432    2.065302
      23399  |  -.3194478   1.152084    -0.28   0.782    -2.577696    1.938801
      23400  |  -.2441201    1.15246    -0.21   0.832    -2.503105    2.014865
      23401  |   .5630418   1.151713     0.49   0.625     -1.69448    2.820564
      23402  |  -.0333668   1.143098    -0.03   0.977    -2.274002    2.207268
      23403  |   .3798109   1.144001     0.33   0.740    -1.862594    2.622215
      23404  |   .4345996    1.14484     0.38   0.704    -1.809449    2.678648
      23405  |  -.2614214   1.144131    -0.23   0.819    -2.504081    1.981238
      23406  |  -.8427182   1.141841    -0.74   0.461    -3.080888    1.395451
      23407  |   1.525672    1.13504     1.34   0.179    -.6991676    3.750512
      23408  |   2.997304   1.144895     2.62   0.009     .7531473    5.241461
      23409  |  -.9701949   1.144742    -0.85   0.397    -3.214052    1.273663
      23410  |  -1.030454   1.159509    -0.89   0.374    -3.303256    1.242348
      23411  |   -.354387   1.153407    -0.31   0.759    -2.615228    1.906454
      23412  |  -1.250489   1.144853    -1.09   0.275    -3.494563    .9935845
      23413  |   -1.22266   1.160556    -1.05   0.292    -3.497515    1.052195
      23414  |  -1.468687   1.160034    -1.27   0.206    -3.742517    .8051436
      23415  |   .4177339    1.16831     0.36   0.721    -1.872319    2.707787
      23416  |  -1.046199   1.143293    -0.92   0.360    -3.287216    1.194818
      23417  |  -.5631241   1.138738    -0.49   0.621    -2.795212    1.668963
      23418  |   -.889243   1.129963    -0.79   0.431    -3.104131    1.325645
      23419  |  -.1525767   1.136687    -0.13   0.893    -2.380644     2.07549
      23420  |   .1746593   1.142896     0.15   0.879    -2.065579    2.414898
      23421  |    1.15441   1.141705     1.01   0.312    -1.083494    3.392314
      23422  |   2.000047   1.147429     1.74   0.081    -.2490772    4.249171
      23423  |   -1.07444   1.135473    -0.95   0.344    -3.300128    1.151249
      23424  |   .9481495   1.134876     0.84   0.403    -1.276368    3.172667
      23425  |   .3859193   1.131517     0.34   0.733    -1.832014    2.603852
      23426  |  -1.024592   1.137828    -0.90   0.368    -3.254897    1.205713
      23427  |  -.5620917   1.136949    -0.49   0.621    -2.790673    1.666489
      23428  |  -.4568231    1.14579    -0.40   0.690    -2.702734    1.789087
      23429  |  -.6040408   1.151524    -0.52   0.600    -2.861191    1.653109
      23430  |   1.808867   1.152945     1.57   0.117    -.4510691    4.068804
      23431  |  -.0346595   1.143702    -0.03   0.976    -2.276477    2.207158
      23432  |  -.0166527   1.134825    -0.01   0.988     -2.24107    2.207765
      23433  |   .5697717   1.135419     0.50   0.616     -1.65581    2.795353
      23434  |   1.351521   1.138941     1.19   0.235    -.8809646    3.584007
      23435  |  -1.280526   1.141923    -1.12   0.262    -3.518857    .9578037
      23436  |  -.8838016   1.158845    -0.76   0.446    -3.155301    1.387698
      23437  |   2.045357   1.162099     1.76   0.078    -.2325214    4.323235
      23438  |    .183156   1.162425     0.16   0.875    -2.095362    2.461674
      23439  |  -.6013135   1.161855    -0.52   0.605    -2.878715    1.676088
      23440  |  -.8882702   1.177352    -0.75   0.451    -3.196047    1.419507
      23441  |  -.5274926   1.176819    -0.45   0.654    -2.834225     1.77924
      23442  |   .0523764    1.19573     0.04   0.965    -2.291423    2.396176
      23443  |  -.6043112   1.177952    -0.51   0.608    -2.913264    1.704642
      23444  |   .4738453    1.16708     0.41   0.685    -1.813797    2.761488
      23445  |   1.612752   1.158652     1.39   0.164     -.658371    3.883875
      23446  |  -.5996823   1.167102    -0.51   0.607    -2.887368    1.688003
      23447  |   .3747654   1.176703     0.32   0.750     -1.93174     2.68127
      23448  |  -.1811445    1.17586    -0.15   0.878    -2.485998    2.123709
      23449  |  -.9173738   1.185239    -0.77   0.439     -3.24061    1.405862
      23450  |   .3530413     1.2064     0.29   0.770    -2.011673    2.717756
      23451  |  -.4679065   1.208036    -0.39   0.699    -2.835828    1.900015
      23452  |  -.7506573   1.195351    -0.63   0.530    -3.093715    1.592401
      23453  |  -.9930289   1.195357    -0.83   0.406    -3.336099    1.350041
      23454  |  -.1542869   1.194531    -0.13   0.897    -2.495737    2.187163
      23455  |   .3891771   1.193389     0.33   0.744    -1.950035    2.728389
      23456  |   2.209988   1.183979     1.87   0.062    -.1107793    4.530756
      23457  |   1.076654   1.166662     0.92   0.356    -1.210169    3.363476
      23458  |   1.072039   1.166645     0.92   0.358     -1.21475    3.358829
      23459  |   1.016774   1.169242     0.87   0.385    -1.275107    3.308654
      23460  |   .2497837   1.178649     0.21   0.832    -2.060535    2.560103
      23461  |   -1.37354   1.177147    -1.17   0.243    -3.680915    .9338351
      23462  |   .0443224   1.176371     0.04   0.970    -2.261532    2.350177
      23463  |   .1321138   1.175473     0.11   0.911     -2.17198    2.436207
      23464  |  -.0356288   1.159142    -0.03   0.975    -2.307711    2.236453
      23465  |   .8278731    1.15916     0.71   0.475    -1.444244     3.09999
      23466  |   .8236545   1.162281     0.71   0.479    -1.454581     3.10189
      23467  |  -1.922685   1.161546    -1.66   0.098     -4.19948    .3541091
      23468  |  -.4017086   1.160763    -0.35   0.729    -2.676968    1.873551
      23469  |  -.8407728    1.16639    -0.72   0.471    -3.127063    1.445518
      23470  |   1.466527   1.166269     1.26   0.209    -.8195257    3.752581
      23471  |  -.5449932    1.17689    -0.46   0.643    -2.851865    1.761878
      23472  |   .8479232   1.169708     0.72   0.469     -1.44487    3.140716
      23473  |  -1.015879   1.168037    -0.87   0.384    -3.305397    1.273638
      23474  |   .6636797   1.168015     0.57   0.570    -1.625795    2.953154
      23475  |   .6694383   1.176657     0.57   0.569    -1.636976    2.975852
      23476  |   .7584958   1.177393     0.64   0.519    -1.549362    3.066354
      23477  |  -1.501559   1.177544    -1.28   0.202    -3.809713    .8065952
      23478  |   .5399097   1.166183     0.46   0.643    -1.745975    2.825794
      23479  |   .3170462   1.165575     0.27   0.786    -1.967646    2.601738
      23480  |   .3158853   1.152195     0.27   0.784    -1.942581    2.574352
      23481  |    .984126   1.154702     0.85   0.394    -1.279255    3.247507
      23482  |  -1.386214   1.162907    -1.19   0.233    -3.665676    .8932478
      23483  |  -1.697452   1.160179    -1.46   0.143    -3.971568    .5766636
      23484  |  -.2691493   1.168055    -0.23   0.818    -2.558702    2.020403
      23485  |   1.323274   1.159602     1.14   0.254    -.9497097    3.596257
      23486  |  -.3064533   1.158651    -0.26   0.791    -2.577574    1.964667
      23487  |   1.832825   1.150405     1.59   0.111    -.4221324    4.087783
      23488  |  -1.002007   1.152438    -0.87   0.385     -3.26095    1.256935
      23489  |  -.5147028    1.15011    -0.45   0.655    -2.769082    1.739676
      23490  |   .1682501   1.150394     0.15   0.884    -2.086686    2.423186
      23491  |   .2214836   1.192871     0.19   0.853    -2.116712     2.55968
      23492  |   .1629681    1.19407     0.14   0.891    -2.177578    2.503515
      23493  |   1.197015   1.196236     1.00   0.317    -1.147778    3.541807
      23494  |   .0586986   1.160264     0.05   0.960    -2.215583     2.33298
      23495  |   .3476969   1.177265     0.30   0.768     -1.95991    2.655303
      23496  |  -1.409839   1.175833    -1.20   0.231    -3.714639    .8949603
      23497  |   1.083325   1.184227     0.91   0.360    -1.237928    3.404578
      23498  |   .3826461   1.184686     0.32   0.747    -1.939507    2.704799
      23499  |   .1565118    1.18429     0.13   0.895    -2.164864    2.477887
      23500  |   1.345332   1.175067     1.14   0.252    -.9579661     3.64863
      23501  |   2.159578   1.160013     1.86   0.063    -.1142109    4.433368
      23502  |   .2050406   1.152734     0.18   0.859    -2.054481    2.464562
      23503  |   .4571578   1.160792     0.39   0.694    -1.818159    2.732474
      23504  |  -.4253579   1.158874    -0.37   0.714    -2.696915    1.846199
      23505  |   .0730088   1.160352     0.06   0.950    -2.201447    2.347464
      23506  |   .0961415   1.167486     0.08   0.934    -2.192297     2.38458
      23507  |   .9707085   1.166421     0.83   0.405    -1.315642    3.257059
      23508  |   .1282865   1.167065     0.11   0.912    -2.159327      2.4159
      23509  |   1.567222   1.159155     1.35   0.176    -.7048858     3.83933
      23510  |   .5919521   1.143592     0.52   0.605    -1.649651    2.833555
      23511  |  -.5571993   1.151074    -0.48   0.628    -2.813467    1.699069
      23512  |   .5335858   1.158648     0.46   0.645    -1.737528      2.8047
      23513  |   1.424346   1.158044     1.23   0.219     -.845585    3.694277
      23514  |   .4609515   1.159635     0.40   0.691    -1.812098    2.734001
      23515  |  -.0058707   1.160181    -0.01   0.996     -2.27999    2.268249
      23516  |  -.3945965    1.15081    -0.34   0.732    -2.650347    1.861154
      23517  |   .2125741   1.150674     0.18   0.853     -2.04291    2.468059
      23518  |  -.1020383   1.150931    -0.09   0.929    -2.358027     2.15395
      23519  |  -.6716443    1.15897    -0.58   0.562    -2.943389      1.6001
      23520  |   .4346297   1.159044     0.37   0.708     -1.83726     2.70652
      23521  |   .2376605   1.157064     0.21   0.837    -2.030349     2.50567
      23522  |   1.926634   1.153411     1.67   0.095     -.334216    4.187483
      23523  |  -2.647468   1.151514    -2.30   0.022    -4.904599    -.390337
      23524  |   1.024699   1.151184     0.89   0.373    -1.231786    3.281184
      23525  |   .4236324   1.166627     0.36   0.717    -1.863122    2.710386
      23526  |   .3522297   1.167541     0.30   0.763    -1.936316    2.640775
      23527  |   .6369355   1.176873     0.54   0.588    -1.669903    2.943774
      23528  |  -.0117632   1.159958    -0.01   0.992    -2.285446     2.26192
      23529  |   .3207998   1.157113     0.28   0.782    -1.947305    2.588905
      23530  |   1.322361   1.158448     1.14   0.254    -.9483607    3.593083
      23531  |   .4277542   1.178533     0.36   0.717    -1.882339    2.737847
      23532  |  -1.681365   1.168233    -1.44   0.150    -3.971267    .6085368
      23533  |  -.4792734   1.161648    -0.41   0.680    -2.756268    1.797721
      23534  |  -.0136613   1.152663    -0.01   0.991    -2.273044    2.245722
      23535  |  -.6175959    1.15114    -0.54   0.592    -2.873993    1.638802
      23536  |   1.623712   1.150792     1.41   0.158    -.6320046    3.879428
      23537  |   .5560127   1.144179     0.49   0.627     -1.68674    2.798766
      23538  |   .6899952   1.168924     0.59   0.555    -1.601262    2.981253
      23539  |   1.389991   1.160376     1.20   0.231    -.8845107    3.664493
      23540  |  -.2485343   1.159709    -0.21   0.830    -2.521727    2.024659
      23541  |    1.32273   1.145088     1.16   0.248     -.921805    3.567264
      23542  |   2.183244   1.142358     1.91   0.056    -.0559401    4.422428
      23543  |   2.333524   1.143544     2.04   0.041     .0920157    4.575031
      23544  |   -.300589   1.150192    -0.26   0.794    -2.555128     1.95395
      23545  |   1.067219   1.152098     0.93   0.354    -1.191057    3.325495
      23546  |   .3344316   1.160073     0.29   0.773    -1.939476    2.608339
      23547  |  -1.883068   1.143514    -1.65   0.100    -4.124516    .3583813
      23548  |   .9731298   1.153461     0.84   0.399    -1.287818    3.234078
      23549  |  -1.490569   1.153633    -1.29   0.196    -3.751854    .7707165
      23550  |   .5027302   1.136008     0.44   0.658    -1.724007    2.729467
      23551  |   2.411181    1.13544     2.12   0.034     .1855574    4.636804
      23552  |   .3158717   1.144315     0.28   0.783    -1.927148    2.558891
      23553  |  -.5086771   1.142062    -0.45   0.656    -2.747281    1.729927
      23554  |  -.0312798   1.143768    -0.03   0.978    -2.273227    2.210668
      23555  |    .737731    1.14524     0.64   0.519    -1.507102    2.982564
      23556  |  -.6555152   1.143823    -0.57   0.567     -2.89757     1.58654
      23557  |   1.329808   1.149548     1.16   0.247    -.9234687    3.583085
      23558  |  -.0615402   1.166862    -0.05   0.958    -2.348755    2.225675
      23559  |  -.9874311   1.160785    -0.85   0.395    -3.262734    1.287872
      23560  |  -1.144725   1.169165    -0.98   0.328    -3.436453    1.147003
      23561  |   1.652594    1.17192     1.41   0.159    -.6445349    3.949722
      23562  |   .8501407   1.169658     0.73   0.467    -1.442555    3.142836
      23563  |   .8087013   1.144722     0.71   0.480    -1.435117     3.05252
      23564  |   1.812351    1.15204     1.57   0.116     -.445811    4.070513
      23565  |   .4320168   1.167546     0.37   0.711    -1.856539    2.720572
      23566  |  -.1484607   1.185532    -0.13   0.900    -2.472272     2.17535
      23567  |  -.6058648   1.185843    -0.51   0.609    -2.930284    1.718555
      23568  |  -.4020169   1.169906    -0.34   0.731    -2.695198    1.891164
      23569  |   .4431983   1.161592     0.38   0.703    -1.833686    2.720083
      23570  |   .7205558   1.143858     0.63   0.529    -1.521568    2.962679
      23571  |   1.687469   1.142307     1.48   0.140    -.5516136    3.926552
      23572  |   1.202685   1.136385     1.06   0.290     -1.02479    3.430161
      23573  |   1.276476   1.157642     1.10   0.270    -.9926674    3.545619
      23574  |   1.558964    1.15813     1.35   0.178    -.7111357    3.829063
      23575  |   .0767144   1.153205     0.07   0.947    -2.183731     2.33716
      23576  |  -.0422236   1.160397    -0.04   0.971    -2.316767     2.23232
      23577  |  -.1407679   1.160347    -0.12   0.903    -2.415213    2.133677
      23578  |  -1.627421     1.1594    -1.40   0.160    -3.900009    .6451662
      23579  |  -.4594685   1.154011    -0.40   0.691    -2.721494    1.802557
      23580  |  -.6549507   1.151332    -0.57   0.569    -2.911725    1.601823
      23581  |   1.837154   1.160249     1.58   0.113    -.4370996    4.111407
      23582  |   .9194433   1.151922     0.80   0.425    -1.338488    3.177374
      23583  |   1.070562   1.166449     0.92   0.359    -1.215842    3.356967
      23584  |   1.031497   1.159617     0.89   0.374    -1.241518    3.304511
      23585  |   .8100926   1.158838     0.70   0.485    -1.461394     3.08158
      23586  |    1.03872    1.15908     0.90   0.370    -1.233242    3.310681
      23587  |   1.452095   1.165767     1.25   0.213    -.8329743    3.737165
      23588  |   2.263375   1.185094     1.91   0.056    -.0595762    4.586327
      23589  |   .1686744   1.185368     0.14   0.887    -2.154815    2.492164
      23590  |   1.073224   1.176666     0.91   0.362    -1.233207    3.379656
      23591  |  -.9905934   1.158779    -0.85   0.393    -3.261964    1.280777
      23592  |  -.2966888   1.150782    -0.26   0.797    -2.552385    1.959007
      23593  |  -.7371093    1.14737    -0.64   0.521    -2.986117    1.511898
      23594  |   -1.25623   1.153227    -1.09   0.276    -3.516719    1.004259
      23595  |   .1059482   1.161077     0.09   0.927    -2.169927    2.381823
      23596  |  -.2340132   1.160139    -0.20   0.840     -2.50805    2.040023
      23597  |   .7327562   1.152995     0.64   0.525    -1.527277    2.992789
      23598  |   .2435192   1.159578     0.21   0.834    -2.029418    2.516456
      23599  |   .5655122   1.158512     0.49   0.625    -1.705337    2.836361
      23600  |   2.178166    1.16671     1.87   0.062    -.1087509    4.465083
      23601  |  -1.516478   1.166431    -1.30   0.194    -3.802847    .7698921
      23602  |   .9214999    1.17462     0.78   0.433    -1.380922    3.223922
      23603  |   .0750175    1.15047     0.07   0.948    -2.180067    2.330102
      23604  |  -.1863242   1.152308    -0.16   0.872    -2.445012    2.072363
      23605  |  -.4627447   1.149392    -0.40   0.687    -2.715716    1.790227
      23606  |   .6609272   1.143478     0.58   0.563    -1.580452    2.902306
      23607  |  -.9051762   1.146221    -0.79   0.430    -3.151932     1.34158
      23608  |  -1.449823   1.143686    -1.27   0.205     -3.69161    .7919634
      23609  |  -.8430709    1.14331    -0.74   0.461    -3.084121    1.397979
      23610  |  -.0170083   1.129794    -0.02   0.988    -2.231564    2.197547
      23611  |  -1.078384    1.13653    -0.95   0.343    -3.306143    1.149375
      23612  |   1.207538   1.136436     1.06   0.288    -1.020037    3.435114
      23613  |   .8330386   1.135631     0.73   0.463    -1.392958    3.059036
      23614  |   .1597073   1.137391     0.14   0.888    -2.069741    2.389156
      23615  |   .4253713   1.136846     0.37   0.708    -1.803009    2.653752
      23616  |   .1123782   1.136743     0.10   0.921    -2.115799    2.340555
      23617  |  -.3281196   1.151787    -0.28   0.776    -2.585786    1.929547
      23618  |  -.0351661   1.153364    -0.03   0.976    -2.295924    2.225592
      23619  |  -1.445594   1.152132    -1.25   0.210    -3.703935    .8127475
      23620  |  -.1006041   1.143202    -0.09   0.930    -2.341442    2.140234
      23621  |   1.000592   1.142052     0.88   0.381    -1.237991    3.239176
      23622  |   1.431531   1.144359     1.25   0.211    -.8115758    3.674638
      23623  |  -1.056068   1.136651    -0.93   0.353    -3.284065    1.171929
      23624  |   .5584001   1.143646     0.49   0.625    -1.683309    2.800109
      23625  |   .3273578   1.150534     0.28   0.776    -1.927852    2.582568
      23626  |   .4958182   1.142615     0.43   0.664    -1.743869    2.735506
      23627  |   .5140504   1.143369     0.45   0.653    -1.727115    2.755216
      23628  |   .3925747    1.14382     0.34   0.731    -1.849475    2.634624
      23629  |   2.732391   1.142772     2.39   0.017     .4923954    4.972386
      23630  |  -.3514611   1.150038    -0.31   0.760    -2.605698    1.902776
      23631  |     -.4255   1.143414    -0.37   0.710    -2.666753    1.815753
      23632  |  -.1204804   1.153867    -0.10   0.917    -2.382223    2.141263
      23633  |  -.1932176   1.143082    -0.17   0.866     -2.43382    2.047385
      23634  |   2.171393   1.134951     1.91   0.056    -.0532722    4.396057
      23635  |  -.2154425   1.143721    -0.19   0.851    -2.457298    2.026413
      23636  |   1.445608   1.143689     1.26   0.206    -.7961847      3.6874
      23637  |   .5654946    1.14252     0.49   0.621    -1.674006    2.804995
      23638  |   1.863269   1.150624     1.62   0.105    -.3921174    4.118656
      23639  |  -.1357086   1.151507    -0.12   0.906    -2.392826    2.121409
      23640  |   .4171871   1.152661     0.36   0.717    -1.842192    2.676566
      23641  |   .6886596   1.143994     0.60   0.547    -1.553731     2.93105
      23642  |   .9957003   1.144084     0.87   0.384    -1.246866    3.238267
      23643  |   .6764984    1.15879     0.58   0.559    -1.594894    2.947891
      23644  |   1.141473   1.158687     0.99   0.325    -1.129719    3.412664
      23645  |   .3412183   1.150669     0.30   0.767    -1.914257    2.596693
      23646  |   1.885135   1.151775     1.64   0.102    -.3725066    4.142777
      23647  |  -.4082186   1.150619    -0.35   0.723    -2.663594    1.847157
      23648  |    .496937   1.150724     0.43   0.666    -1.758645    2.752519
      23649  |  -.0088458   1.153142    -0.01   0.994    -2.269168    2.251476
      23650  |  -1.412364   1.152649    -1.23   0.220    -3.671719    .8469916
      23651  |  -.1084363   1.152696    -0.09   0.925    -2.367884    2.151011
      23652  |  -.0229558   1.145016    -0.02   0.984     -2.26735    2.221438
      23653  |   -.340732   1.144893    -0.30   0.766    -2.584885    1.903421
      23654  |  -.2271399   1.143692    -0.20   0.843    -2.468939    2.014659
      23655  |  -.2703278   1.135291    -0.24   0.812    -2.495659    1.955004
      23656  |   1.604818   1.136999     1.41   0.158    -.6238613    3.833498
      23657  |   -.509779   1.130022    -0.45   0.652    -2.724782    1.705224
      23658  |   .9767182   1.128651     0.87   0.387    -1.235598    3.189034
      23659  |   1.028306   1.137779     0.90   0.366    -1.201902    3.258515
      23660  |   1.120403   1.135936     0.99   0.324    -1.106193    3.346998
      23661  |   -.112416   1.134448    -0.10   0.921    -2.336095    2.111263
      23662  |   2.439189   1.138646     2.14   0.032     .2072808    4.671097
      23663  |   .2360594   1.143605     0.21   0.836    -2.005568    2.477687
      23664  |   .2929277   1.143899     0.26   0.798    -1.949276    2.535132
      23665  |  -.4415136   1.141786    -0.39   0.699    -2.679576    1.796549
      23666  |   1.416305   1.135994     1.25   0.213    -.8104047    3.643015
      23667  |  -.3837597   1.144473    -0.34   0.737    -2.627088    1.859569
      23668  |   .5738085   1.145458     0.50   0.616    -1.671451    2.819068
      23669  |   .0745315   1.135792     0.07   0.948    -2.151781    2.300844
      23670  |   .3320943   1.135724     0.29   0.770    -1.894087    2.558275
      23671  |   -.281879   1.151701    -0.24   0.807    -2.539377    1.975619
      23672  |  -.5051492   1.168485    -0.43   0.666    -2.795546    1.785248
      23673  |   1.663506   1.175096     1.42   0.157    -.6398477     3.96686
      23674  |   .4610783   1.178535     0.39   0.696    -1.849017    2.771174
      23675  |   .4338272   1.176115     0.37   0.712    -1.871524    2.739179
      23676  |   2.004362   1.157143     1.73   0.083    -.2638013    4.272526
      23677  |   1.544149   1.157744     1.33   0.182    -.7251932     3.81349
      23678  |    1.43799   1.159235     1.24   0.215    -.8342748    3.710254
      23679  |  -.1399577   1.160524    -0.12   0.904     -2.41475    2.134834
      23680  |  -.0718333   1.158774    -0.06   0.951    -2.343196    2.199529
      23681  |   .3090556   1.153011     0.27   0.789    -1.951009     2.56912
      23682  |  -1.943676   1.150278    -1.69   0.091    -4.198384    .3110321
      23683  |   1.449881   1.149592     1.26   0.207    -.8034819    3.703245
      23684  |   1.467649   1.144701     1.28   0.200    -.7761274    3.711426
      23685  |   1.002496   1.143945     0.88   0.381    -1.239799    3.244791
      23686  |      1.161   1.143298     1.02   0.310    -1.080026    3.402027
      23687  |   .0280249    1.13769     0.02   0.980    -2.202008    2.258058
      23688  |  -1.362734   1.140597    -1.19   0.232    -3.598465    .8729976
      23689  |  -1.624152   1.141368    -1.42   0.155    -3.861394     .613091
      23690  |   -.164331   1.140218    -0.14   0.885    -2.399321    2.070659
      23691  |   .8494486   1.135995     0.75   0.455    -1.377262    3.076159
      23692  |   2.427969   1.135079     2.14   0.032      .203053    4.652886
      23693  |   1.883205   1.144852     1.64   0.100    -.3608677    4.127277
      23694  |   .3182067   1.150376     0.28   0.782    -1.936693    2.573107
      23695  |   .7770314   1.149957     0.68   0.499    -1.477048    3.031111
      23696  |   .4561379   1.153287     0.40   0.692    -1.804468    2.716744
      23697  |   -1.75788    1.14465    -1.54   0.125    -4.001555    .4857959
      23698  |    .002572   1.142513     0.00   0.998    -2.236916     2.24206
      23699  |   .7839065   1.159871     0.68   0.499    -1.489605    3.057419
      23700  |   .6970125   1.157556     0.60   0.547    -1.571961    2.965986
      23701  |   1.974761    1.16622     1.69   0.090    -.3111955    4.260717
      23702  |   1.585959   1.144199     1.39   0.166    -.6568341    3.828752
      23703  |  -.1078567   1.142486    -0.09   0.925    -2.347292    2.131579
      23704  |   .2990611    1.14365     0.26   0.794    -1.942656    2.540778
      23705  |  -.8973915   1.150735    -0.78   0.435    -3.152995    1.358212
      23706  |  -.7144392   1.151042    -0.62   0.535    -2.970645    1.541766
      23707  |   .4288488   1.152364     0.37   0.710    -1.829949    2.687646
      23708  |   .4479087   1.152239     0.39   0.697    -1.810644    2.706461
      23709  |  -.7675637   1.152652    -0.67   0.505    -3.026926    1.491798
      23710  |  -.4350216   1.147134    -0.38   0.705    -2.683566    1.813523
      23711  |   .7894816   1.154582     0.68   0.494    -1.473663    3.052626
      23712  |   .4470472   1.154503     0.39   0.699    -1.815942    2.710036
      23713  |   1.040603   1.157455     0.90   0.369    -1.228173    3.309379
      23714  |   .1418589   1.158489     0.12   0.903    -2.128945    2.412663
      23715  |   1.205798   1.159369     1.04   0.298     -1.06673    3.478327
      23716  |   .8072679   1.150589     0.70   0.483     -1.44805    3.062586
      23717  |   2.054525   1.153634     1.78   0.075    -.2067616    4.315811
      23718  |    .721516   1.142792     0.63   0.528    -1.518518     2.96155
      23719  |   2.526457   1.130693     2.23   0.025     .3101381    4.742776
      23720  |   1.878801   1.140903     1.65   0.100      -.35753    4.115132
      23721  |   .1738692   1.142217     0.15   0.879    -2.065038    2.412776
      23722  |   1.122206   1.137576     0.99   0.324    -1.107604    3.352017
      23723  |   2.636099   1.134728     2.32   0.020     .4118711    4.860327
      23724  |   1.426299   1.157757     1.23   0.218    -.8430693    3.695667
      23725  |   1.458324   1.177477     1.24   0.216    -.8496972    3.766346
      23726  |  -.9022756   1.184773    -0.76   0.446    -3.224598    1.420047
      23727  |   .5095232   1.184566     0.43   0.667    -1.812393     2.83144
      23728  |   .8101104   1.185938     0.68   0.495    -1.514496    3.134717
      23729  |   .4419325    1.17069     0.38   0.706    -1.852785     2.73665
      23730  |  -1.477128   1.154533    -1.28   0.201    -3.740176    .7859199
      23731  |  -.5559563   1.153272    -0.48   0.630    -2.816533    1.704621
      23732  |    .599945   1.144258     0.52   0.600    -1.642963    2.842853
      23733  |   1.830517   1.137611     1.61   0.108    -.3993614    4.060396
      23734  |  -1.100542   1.135003    -0.97   0.332    -3.325308    1.124225
      23735  |    .066654    1.13671     0.06   0.953    -2.161459    2.294767
      23736  |  -.3633239   1.135196    -0.32   0.749    -2.588469    1.861821
      23737  |   .1179581   1.143874     0.10   0.918    -2.124198    2.360114
      23738  |   -.660208   1.143374    -0.58   0.564    -2.901384    1.580968
      23739  |   .7304182   1.150036     0.64   0.525    -1.523816    2.984653
      23740  |   .5761771    1.16671     0.49   0.621     -1.71074    2.863094
      23741  |    1.34947   1.172168     1.15   0.250    -.9481454    3.647086
             |
       _cons |   10.70602   .8205628    13.05   0.000     9.097598    12.31444
-------------+----------------------------------------------------------------
     sigma_u |  .35773428
     sigma_e |  5.0407852
         rho |  .00501121   (fraction of variance due to u_i)
------------------------------------------------------------------------------
F test that all u_i=0: F(40, 13340) = 1.48                   Prob > F = 0.0268

. //  The lag of aqi affects mortality more than aqi on the current day. 0.06 unit diffe
> rence. The coefficients are statistically significant
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/kismet/economics/predoc_datatask25/analysis/scripts/../logs/predoc25
> exc_log.txt
  log type:  text
 closed on:   7 Jan 2026, 19:03:46
----------------------------------------------------------------------------------------
